apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
/****************************************************************************
 * arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#ifdef CONFIG_ESP32C3_RSA_ACCELERATOR

#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <semaphore.h>

#include "riscv_internal.h"
#include "esp32c3_rsa.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define ESP32C3_PKCS1_V15
#define RSA_EXPONENT_BLINDING 28

/****************************************************************************
 * Private Data
 ****************************************************************************/

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rsa_check_context
 *
 * Description:
 *   Checks whether the context fields are set in such a way
 *   that the RSA primitives will be able to execute without error.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to store the parameters in
 *   N        - The RSA modulus
 *   NL    - The Byte length of \p N
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int rsa_check_context(struct esp32c3_rsa_context_s const *ctx,
                             int is_priv, int blinding_needed)
{
#if !defined(ESP32C3_RSA_NO_CRT)
  ((void) blinding_needed);
#endif

  if (ctx->len != esp32c3_mpi_size(&ctx->N) ||
      ctx->len > ESP32C3_MPI_MAX_SIZE)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  /* 1. Modular exponentiation needs positive, odd moduli */

  if (esp32c3_mpi_cmp_int(&ctx->N, 0) <= 0 ||
      esp32c3_mpi_get_bit(&ctx->N, 0) == 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

#if !defined(ESP32C3_RSA_NO_CRT)
  if (is_priv &&
     (esp32c3_mpi_cmp_int(&ctx->P, 0) <= 0 ||
      esp32c3_mpi_get_bit(&ctx->P, 0) == 0 ||
      esp32c3_mpi_cmp_int(&ctx->Q, 0) <= 0 ||
      esp32c3_mpi_get_bit(&ctx->Q, 0) == 0))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }
#endif /* !ESP32C3_RSA_NO_CRT */

  /* 2. Exponents must be positive */

  /* Always need E for public key operations */

  if (esp32c3_mpi_cmp_int(&ctx->E, 0) <= 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

#if defined(ESP32C3_RSA_NO_CRT)
  /* For private key operations, use D or DP & DQ as exponents */

  if (is_priv && esp32c3_mpi_cmp_int(&ctx->D, 0) <= 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }
#else
  if (is_priv &&
     (esp32c3_mpi_cmp_int(&ctx->DP, 0) <= 0 ||
      esp32c3_mpi_cmp_int(&ctx->DQ, 0) <= 0))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }
#endif /* ESP32C3_RSA_NO_CRT */

#if defined(ESP32C3_RSA_NO_CRT)
  if (is_priv && blinding_needed &&
     (esp32c3_mpi_cmp_int(&ctx->P, 0) <= 0 ||
      esp32c3_mpi_cmp_int(&ctx->Q, 0) <= 0))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }
#endif

#if !defined(ESP32C3_RSA_NO_CRT)
  if (is_priv && esp32c3_mpi_cmp_int(&ctx->QP, 0) <= 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: rsa_prepare_blinding
 *
 * Description:
 *   Generate or update blinding values.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to store the parameters in.
 *   f_rng    - The RNG function
 *   p_rng    - The RNG context to pass to \p f_rng
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int rsa_prepare_blinding(struct esp32c3_rsa_context_s *ctx,
         int (*f_rng)(void *, unsigned char *, size_t), void *p_rng)
{
  int ret;
  int count = 0;
  struct esp32c3_mpi_s R;

  esp32c3_mpi_init(&R);

  if (ctx->VF.p != NULL)
    {
      /* We already have blinding values, just update them by squaring */

      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&ctx->VI, &ctx->VI, &ctx->VI),
                      cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&ctx->VI, &ctx->VI, &ctx->N),
                      cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&ctx->VF, &ctx->VF, &ctx->VF),
                      cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&ctx->VF, &ctx->VF, &ctx->N),
                      cleanup);

      goto cleanup;
    }

  /* Unblinding value: VF = random number, invertible mod N */

  do
    {
      if (count++ > 10)
        {
          ret = ESP32C3_ERR_RSA_RNG_FAILED;
          goto cleanup;
        }

      ESP32C3_MPI_CHK(esp32c3_mpi_fill_random(&ctx->VF, ctx->len - 1,
                                              f_rng, p_rng), cleanup);

      /* Compute VF^-1 as R * (R VF)^-1 to avoid leaks from inv_mod. */

      ESP32C3_MPI_CHK(esp32c3_mpi_fill_random(&R, ctx->len - 1,
                                              f_rng, p_rng), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&ctx->VI, &ctx->VF, &R),
                      cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&ctx->VI, &ctx->VI, &ctx->N),
                      cleanup);

