apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
      ret = esp32c3_mpi_inv_mod(&ctx->VI, &ctx->VI, &ctx->N);
      if (ret != 0 && ret != ESP32C3_ERR_MPI_NOT_ACCEPTABLE)
        {
          goto cleanup;
        }
    }
  while (ret == ESP32C3_ERR_MPI_NOT_ACCEPTABLE);

  /* Finish the computation of VF^-1 = R * (R VF)^-1 */

  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&ctx->VI, &ctx->VI, &R),
                  cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&ctx->VI, &ctx->VI, &ctx->N),
                  cleanup);

  /* Blinding value: VI = VF^(-e) mod N */

  ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&ctx->VI, &ctx->VI,
                                      &ctx->E, &ctx->N, &ctx->RN),
                  cleanup);

cleanup:
  esp32c3_mpi_free(&R);

  return ret;
}

#if defined(ESP32C3_PKCS1_V15)
/* Implementation of the PKCS1-V1_5-ENCRYPT function */

static int esp32c3_rsa_pkcs1_v15_encrypt(struct esp32c3_rsa_context_s *ctx,
                 int (*f_rng)(void *, unsigned char *, size_t),
                 void *p_rng,
                 int mode, size_t ilen,
                 const unsigned char *input,
                 unsigned char *output)
{
  size_t nb_pad;
  size_t olen;
  int ret;
  unsigned char *p = output;

  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(mode == ESP32C3_RSA_PRIVATE ||
              mode == ESP32C3_RSA_PUBLIC);
  DEBUGASSERT(output != NULL);
  DEBUGASSERT(input != NULL);

  if (mode == ESP32C3_RSA_PRIVATE && ctx->padding != ESP32C3_RSA_PKCS_V15)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  olen = ctx->len;

  /* first comparison checks for overflow */

  if (ilen + 11 < ilen || olen < ilen + 11)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  nb_pad = olen - 3 - ilen;

  *p++ = 0;
  if (mode == ESP32C3_RSA_PUBLIC)
    {
      if (f_rng == NULL)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
        }

      *p++ = ESP32C3_RSA_CRYPT;

      while (nb_pad-- > 0)
        {
          int rng_dl = 100;

          do
            {
              ret = f_rng(p_rng, p, 1);
            }
          while (*p == 0 && --rng_dl && ret == 0);

          /* Check if RNG failed to generate data */

          if (rng_dl == 0 || ret != 0)
            {
              return (ESP32C3_ERR_RSA_RNG_FAILED + ret);
            }

          p++;
        }
    }
  else
    {
      *p++ = ESP32C3_RSA_SIGN;

      while (nb_pad-- > 0)
        {
          *p++ = 0xff;
        }
    }

  *p++ = 0;
  memcpy(p, input, ilen);

  return ((mode == ESP32C3_RSA_PUBLIC)
          ? esp32c3_rsa_public(ctx, output, output)
          : esp32c3_rsa_private(ctx, f_rng, p_rng, output, output));
}
#endif /* ESP32C3_PKCS1_V15 */

#if defined(ESP32C3_PKCS1_V15)

/****************************************************************************
 * Name: all_or_nothing_int
 *
 * Description:
 *   Turn zero-or-nonzero into zero-or-all-bits-one, without branches.
 *
 * Input Parameters:
 *   value    - The value to analyze.
 *
 * Returned Value:
 *   Zero if \p value is zero, otherwise all-bits-one.
 *
 ****************************************************************************/

static unsigned all_or_nothing_int(unsigned value)
{
  return (- ((value | - value) >> (sizeof(value) * 8 - 1)));
}

/****************************************************************************
 * Name: size_greater_than
 *
 * Description:
 *   Check whether a size is out of bounds, without branches.
 *
 * Input Parameters:
 *   size     - Size to check.
 *   max      - Maximum desired value for \p size.
 *
 * Returned Value:
 *   \c 0 if `size <= max`, \c 1 if `size > max`.
 *
 ****************************************************************************/

static unsigned size_greater_than(size_t size, size_t max)
{
  /* Return the sign bit (1 for negative) of (max - size). */

  return ((max - size) >> (sizeof(size_t) * 8 - 1));
}

/****************************************************************************
 * Name: if_int
 *
 * Description:
 *   Choose between two integer values, without branches.
 *
 * Input Parameters:
 *   cond     - Condition to test.
 *   if1      - Value to use if \p cond is nonzero.
 *   if0      - Value to use if \p cond is zero.
 *
 * Returned Value:
 *   \c if1 if \p cond is nonzero, otherwise \c if0.
 *
 ****************************************************************************/

static unsigned if_int(unsigned cond, unsigned if1, unsigned if0)
{
  unsigned mask = all_or_nothing_int(cond);
  return ((mask & if1) | (~mask & if0));
}

/****************************************************************************
 * Name: mem_move_to_left
 *
 * Description:
 *   Shift some data towards the left inside a buffer without leaking
 *   the length of the data through side channels.
 *
 * Input Parameters:
 *   start    - Pointer to the start of the buffer.
 *   total    - Total size of the buffer.
 *   offset   - Offset from which to copy bytes.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void mem_move_to_left(void *start,
                size_t total,
                size_t offset)
{
  volatile unsigned char *buf = start;
  size_t i;
  size_t n;
  if (total == 0)
    {
      return;
    }

  for (i = 0; i < total; i++)
    {
      unsigned no_op = size_greater_than(total - offset, i);
      for (n = 0; n < total - 1; n++)
        {
          unsigned char current = buf[n];
          unsigned char next = buf[n + 1];
          buf[n] = if_int(no_op, current, next);
        }

      buf[total - 1] = if_int(no_op, buf[total - 1], 0);
    }
}

/* Implementation of the PKCS#1 v2.1 RSAES-PKCS1-V1_5-DECRYPT function */

static int esp32c3_rsa_pkcs1_v15_decrypt(struct esp32c3_rsa_context_s *ctx,
                 int (*f_rng)(void *, unsigned char *, size_t),
                 void *p_rng,
                 int mode, size_t *olen,
                 const unsigned char *input,
                 unsigned char *output,
                 size_t output_max_len)
{
  int ret;
  size_t ilen;
  size_t i;
  size_t plaintext_max_size;
  unsigned char buf[ESP32C3_MPI_MAX_SIZE];
  size_t pad_count = 0;
  unsigned bad = 0;
  unsigned char pad_done = 0;
  size_t plaintext_size = 0;
  unsigned output_too_large;

  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(mode == ESP32C3_RSA_PRIVATE ||
              mode == ESP32C3_RSA_PUBLIC);
  DEBUGASSERT(output_max_len == 0 || output != NULL);
  DEBUGASSERT(input != NULL);
  DEBUGASSERT(olen != NULL);

  ilen = ctx->len;
  plaintext_max_size = (output_max_len > ilen - 11 ?
               ilen - 11 :
               output_max_len);

