apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
  if (mode == ESP32C3_RSA_PRIVATE && ctx->padding != ESP32C3_RSA_PKCS_V15)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  if (ilen < 16 || ilen > sizeof(buf))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  ret = (mode == ESP32C3_RSA_PUBLIC)
      ? esp32c3_rsa_public(ctx, input, buf)
      : esp32c3_rsa_private(ctx, f_rng, p_rng, input, buf);

  if (ret != 0)
    {
      goto cleanup;
    }

  /* Check and get padding length in constant time */

  bad |= buf[0];

  if (mode == ESP32C3_RSA_PRIVATE)
    {
      /* Decode EME-PKCS1-v1_5 padding */

      bad |= buf[1] ^ ESP32C3_RSA_CRYPT;

      /* Read the whole buffer */

      for (i = 2; i < ilen; i++)
        {
          pad_done  |= ((buf[i] | (unsigned char)-buf[i]) >> 7) ^ 1;
          pad_count += ((pad_done | (unsigned char)-pad_done) >> 7) ^ 1;
        }
    }
  else
    {
      /* Decode EMSA-PKCS1-v1_5 padding */

      bad |= buf[1] ^ ESP32C3_RSA_SIGN;

      /* Read the whole buffer */

      for (i = 2; i < ilen; i++)
        {
          pad_done |= if_int(buf[i], 0, 1);
          pad_count += if_int(pad_done, 0, 1);
          bad |= if_int(pad_done, 0, buf[i] ^ 0xff);
        }
    }

  /* If pad_done is still zero, there's no data, only unfinished padding. */

  bad |= if_int(pad_done, 0, 1);

  /* There must be at least 8 bytes of padding. */

  bad |= size_greater_than(8, pad_count);
  plaintext_size = if_int(bad,
               (unsigned) plaintext_max_size,
               (unsigned) (ilen - pad_count - 3));
  output_too_large = size_greater_than(plaintext_size,
                      plaintext_max_size);

  /* Set ret without branches to avoid timing attacks */

  ret = - (int) if_int(bad, - ESP32C3_ERR_RSA_INVALID_PADDING,
          if_int(output_too_large, - ESP32C3_ERR_RSA_OUTPUT_TOO_LARGE,
              0));

  /* If the padding is bad or the plaintext is too large, zero the data */

  bad = all_or_nothing_int(bad | output_too_large);
  for (i = 11; i < ilen; i++)
    buf[i] &= ~bad;

  /* If the plaintext is too large, truncate it to the buffer size. */

  plaintext_size = if_int(output_too_large,
               (unsigned) plaintext_max_size,
               (unsigned) plaintext_size);

  /* Move the plaintext to the leftmost position */

  mem_move_to_left(buf + ilen - plaintext_max_size,
            plaintext_max_size,
            plaintext_max_size - plaintext_size);

  /* Copy the decrypted plaintext into the output buffer */

  memcpy(output, buf + ilen - plaintext_max_size, plaintext_max_size);

  /* Report the amount of data we copied to the output buffer */

  *olen = plaintext_size;

cleanup:
  memset(buf, 0, sizeof(buf));

  return ret;
}
#endif /* ESP32C3_PKCS1_V15 */

/****************************************************************************
 * Name: esp32c3_rsa_deduce_primes
 *
 * Description:
 *   Compute RSA prime moduli P, Q from public modulus N=PQ
 *   and a pair of private and public key.
 *
 * Input Parameters:
 *   N        - RSA modulus N = PQ, with P, Q to be found
 *   E        - RSA public exponent
 *   D        - RSA private exponent
 *   P        - Pointer to MPI holding first prime factor of N on success
 *   Q        - Pointer to MPI holding second prime factor of N on success
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int esp32c3_rsa_deduce_primes(struct esp32c3_mpi_s const *N,
           struct esp32c3_mpi_s const *E, struct esp32c3_mpi_s const *D,
           struct esp32c3_mpi_s *P, struct esp32c3_mpi_s *Q)
{
  int ret = 0;

  uint16_t attempt;  /* Number of current attempt  */
  uint16_t iter;     /* Number of squares computed in the current attempt */

  uint16_t order;    /* Order of 2 in DE - 1 */

  struct esp32c3_mpi_s T;     /* Holds largest odd divisor of DE - 1   */
  struct esp32c3_mpi_s K;     /* Temporary holding the current candidate */

  const unsigned char primes[] =
  {
    2, 3,  5,  7,   11,   13,   17,   19,   23,
    29,   31,   37,   41,   43,   47,   53,   59,
    61,   67,   71,   73,   79,   83,   89,   97,
    101,  103,  107,  109,  113,  127,  131,  137,
    139,  149,  151,  157,  163,  167,  173,  179,
    181,  191,  193,  197,  199,  211,  223,  227,
    229,  233,  239,  241,  251
  };

  const size_t num_primes = sizeof(primes) / sizeof(*primes);

  if (P == NULL || Q == NULL || P->p != NULL || Q->p != NULL)
    {
      return (ESP32C3_ERR_MPI_BAD_INPUT_DATA);
    }

  if (esp32c3_mpi_cmp_int(N, 0) <= 0 ||
      esp32c3_mpi_cmp_int(D, 1) <= 0 ||
      esp32c3_mpi_cmp_mpi(D, N) >= 0 ||
      esp32c3_mpi_cmp_int(E, 1) <= 0 ||
      esp32c3_mpi_cmp_mpi(E, N) >= 0)
    {
      return (ESP32C3_ERR_MPI_BAD_INPUT_DATA);
    }

  /* Initializations and temporary changes */

  esp32c3_mpi_init(&K);
  esp32c3_mpi_init(&T);

  /* T := DE - 1 */

  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&T, D,  E), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&T, &T, 1), cleanup);

  if ((order = (uint16_t) esp32c3_mpi_lsb(&T)) == 0)
    {
      ret = ESP32C3_ERR_MPI_BAD_INPUT_DATA;
      goto cleanup;
    }

  /* After this operation, T holds the largest odd divisor of DE - 1. */

  ESP32C3_MPI_CHK(esp32c3_mpi_shift_r(&T, order), cleanup);

  /* Skip trying 2 if N == 1 mod 8 */

  attempt = 0;
  if (N->p[0] % 8 == 1)
    {
        attempt = 1;
    }

  for (; attempt < num_primes; ++attempt)
    {
      esp32c3_mpi_lset(&K, primes[attempt]);

      /* Check if gcd(K,N) = 1 */

      ESP32C3_MPI_CHK(esp32c3_mpi_gcd(P, &K, N), cleanup);
      if (esp32c3_mpi_cmp_int(P, 1) != 0)
        {
          continue;
        }

      /* Go through K^T + 1, K^(2T) + 1, K^(4T) + 1, ... */

      ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&K, &K, &T, N, Q), cleanup);

      for (iter = 1; iter <= order; ++iter)
        {
          /* Continuing to square K */

          if (esp32c3_mpi_cmp_int(&K, 1) == 0)
            {
              break;
            }

          ESP32C3_MPI_CHK(esp32c3_mpi_add_int(&K, &K, 1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_gcd(P, &K, N), cleanup);

          if (esp32c3_mpi_cmp_int(P, 1) ==  1 &&
              esp32c3_mpi_cmp_mpi(P, N) == -1)
            {
              /* Q := N / P */

              ESP32C3_MPI_CHK(esp32c3_mpi_div_mpi(Q, NULL, N, P), cleanup);
              goto cleanup;
            }

          ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, &K, 1), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&K, &K, &K), cleanup);
          ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&K, &K, N), cleanup);
        }

      if (esp32c3_mpi_cmp_int(&K, 1) != 0)
        {
          break;
        }
    }

  ret = ESP32C3_ERR_MPI_BAD_INPUT_DATA;

cleanup:
  esp32c3_mpi_free(&K);
  esp32c3_mpi_free(&T);
  return ret;
}

/****************************************************************************
 * Name: esp32c3_rsa_deduce_private_exponent
 *
 * Description:
 *   Compute RSA private exponent from prime moduli and public key.
 *
 * Input Parameters:
 *   P        First prime factor of RSA modulus
 *   Q        Second prime factor of RSA modulus
 *   E        RSA public exponent
 *   D        Pointer to MPI holding the private exponent on success.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

