apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
static int esp32c3_rsa_deduce_private_exponent(struct esp32c3_mpi_s const *P,
                     struct esp32c3_mpi_s const *Q,
                     struct esp32c3_mpi_s const *E,
                     struct esp32c3_mpi_s *D)
{
  int ret = 0;
  struct esp32c3_mpi_s K;
  struct esp32c3_mpi_s L;

  if (D == NULL || esp32c3_mpi_cmp_int(D, 0) != 0)
    {
      return (ESP32C3_ERR_MPI_BAD_INPUT_DATA);
    }

  if (esp32c3_mpi_cmp_int(P, 1) <= 0 ||
      esp32c3_mpi_cmp_int(Q, 1) <= 0 ||
      esp32c3_mpi_cmp_int(E, 0) == 0)
    {
      return (ESP32C3_ERR_MPI_BAD_INPUT_DATA);
    }

  esp32c3_mpi_init(&K);
  esp32c3_mpi_init(&L);

  /* Temporarily put K := P-1 and L := Q-1 */

  ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, P, 1), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&L, Q, 1), cleanup);

  /* Temporarily put D := gcd(P-1, Q-1) */

  ESP32C3_MPI_CHK(esp32c3_mpi_gcd(D, &K, &L), cleanup);

  /* K := LCM(P-1, Q-1) */

  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&K, &K, &L), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_div_mpi(&K, NULL, &K, D), cleanup);

  /* Compute modular inverse of E in LCM(P-1, Q-1) */

  ESP32C3_MPI_CHK(esp32c3_mpi_inv_mod(D, E, &K), cleanup);

cleanup:
  esp32c3_mpi_free(&K);
  esp32c3_mpi_free(&L);

  return ret;
}

/****************************************************************************
 * Name: esp32c3_rsa_validate_crt
 *
 * Description:
 *   Check validity of core RSA parameters
 *
 * Input Parameters:
 *   P        - First prime factor of RSA modulus
 *   Q        - Second prime factor of RSA modulus
 *   D        - RSA private exponent
 *   DP       - MPI to check for D modulo P-1
 *   DQ       - MPI to check for D modulo P-1
 *   QP       - MPI to check for the modular inverse of Q modulo P.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int esp32c3_rsa_validate_crt(
        const struct esp32c3_mpi_s *P,
        const struct esp32c3_mpi_s *Q,
        const struct esp32c3_mpi_s *D,
        const struct esp32c3_mpi_s *DP,
        const struct esp32c3_mpi_s *DQ,
        const struct esp32c3_mpi_s *QP)
{
  int ret = 0;

  struct esp32c3_mpi_s K;
  struct esp32c3_mpi_s L;

  esp32c3_mpi_init(&K);
  esp32c3_mpi_init(&L);

  /* Check that DP - D == 0 mod P - 1 */

  if (DP != NULL)
    {
      if (P == NULL)
        {
          ret = ESP32C3_ERR_RSA_BAD_INPUT_DATA;
          goto cleanup;
        }

      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, P, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&L, DP, D), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&L, &L, &K), cleanup);

      if (esp32c3_mpi_cmp_int(&L, 0) != 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }
    }

  /* Check that DQ - D == 0 mod Q - 1 */

  if (DQ != NULL)
    {
      if (Q == NULL)
        {
          ret = ESP32C3_ERR_RSA_BAD_INPUT_DATA;
          goto cleanup;
        }

      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, Q, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&L, DQ, D), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&L, &L, &K), cleanup);

      if (esp32c3_mpi_cmp_int(&L, 0) != 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }
    }

  /* Check that QP * Q - 1 == 0 mod P */

  if (QP != NULL)
    {
      if (P == NULL || Q == NULL)
        {
          ret = ESP32C3_ERR_RSA_BAD_INPUT_DATA;
          goto cleanup;
        }

      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&K, QP, Q), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, &K, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&K, &K, P), cleanup);
      if (esp32c3_mpi_cmp_int(&K, 0) != 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }
    }

cleanup:

  /* Wrap MPI error codes by RSA check failure error code */

  if (ret != 0 &&
      ret != ESP32C3_ERR_RSA_KEY_CHECK_FAILED &&
      ret != ESP32C3_ERR_RSA_BAD_INPUT_DATA)
    {
      ret += ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
    }

  esp32c3_mpi_free(&K);
  esp32c3_mpi_free(&L);

  return ret;
}

/****************************************************************************
 * Name: esp32c3_rsa_validate_params
 *
 * Description:
 *   Check validity of core RSA parameters
 *
 * Input Parameters:
 *   N        - RSA modulus N = PQ
 *   P        - First prime factor of N
 *   Q        - Second prime factor of N
 *   D        - RSA private exponent
 *   E        - RSA public exponent
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int esp32c3_rsa_validate_params(const struct esp32c3_mpi_s *N,
                 const struct esp32c3_mpi_s *P,
                 const struct esp32c3_mpi_s *Q,
                 const struct esp32c3_mpi_s *D,
                 const struct esp32c3_mpi_s *E,
                 int (*f_rng)(void *, unsigned char *, size_t),
                 void *p_rng)
{
  int ret = 0;
  struct esp32c3_mpi_s K;
  struct esp32c3_mpi_s L;

  esp32c3_mpi_init(&K);
  esp32c3_mpi_init(&L);

  /* Step 1: Check that 1 < N = P * Q */

  if (P != NULL && Q != NULL && N != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&K, P, Q), cleanup);
      if (esp32c3_mpi_cmp_int(N, 1)  <= 0 ||
          esp32c3_mpi_cmp_mpi(&K, N) != 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }
    }

  /* Step 2: Check and 1 < D, E < N if present */

  if (N != NULL && D != NULL && E != NULL)
    {
      if (esp32c3_mpi_cmp_int(D, 1) <= 0 ||
          esp32c3_mpi_cmp_int(E, 1) <= 0 ||
          esp32c3_mpi_cmp_mpi(D, N) >= 0 ||
          esp32c3_mpi_cmp_mpi(E, N) >= 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }
    }

  /* Step 3: Check that D, E are inverse modulo P-1 and Q-1 */

  if (P != NULL && Q != NULL && D != NULL && E != NULL)
    {
      if (esp32c3_mpi_cmp_int(P, 1) <= 0 ||
          esp32c3_mpi_cmp_int(Q, 1) <= 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }

      /* Compute DE-1 mod P-1 */

      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&K, D, E), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, &K, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&L, P, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&K, &K, &L), cleanup);
      if (esp32c3_mpi_cmp_int(&K, 0) != 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }

