apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
      /* Compute DE-1 mod Q-1 */

      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&K, D, E), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, &K, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&L, Q, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&K, &K, &L), cleanup);
      if (esp32c3_mpi_cmp_int(&K, 0) != 0)
        {
          ret = ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
          goto cleanup;
        }
    }

cleanup:
  esp32c3_mpi_free(&K);
  esp32c3_mpi_free(&L);

  /* Wrap MPI error codes by RSA check failure error code */

  if (ret != 0 && ret != ESP32C3_ERR_RSA_KEY_CHECK_FAILED)
    {
      ret += ESP32C3_ERR_RSA_KEY_CHECK_FAILED;
    }

  return ret;
}

/****************************************************************************
 * Name: esp32c3_rsa_deduce_crt
 *
 * Description:
 *   Generate RSA-CRT parameters
 *
 * Input Parameters:
 *   P        - First prime factor of N
 *   Q        - Second prime factor of N
 *   D        - RSA private exponent
 *   DP       - Output variable for D modulo P-1
 *   DQ       - Output variable for D modulo Q-1
 *   QP       - Output variable for the modular inverse of Q modulo P
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

static int esp32c3_rsa_deduce_crt(const struct esp32c3_mpi_s *P,
                                  const struct esp32c3_mpi_s *Q,
                                  const struct esp32c3_mpi_s *D,
                                  struct esp32c3_mpi_s *DP,
                                  struct esp32c3_mpi_s *DQ,
                                  struct esp32c3_mpi_s *QP)
{
  int ret = 0;
  struct esp32c3_mpi_s K;
  esp32c3_mpi_init(&K);

  /* DP = D mod P-1 */

  if (DP != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, P, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(DP, D, &K), cleanup);
    }

  /* DQ = D mod Q-1 */

  if (DQ != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&K, Q, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(DQ, D, &K), cleanup);
    }

  /* QP = Q^{-1} mod P */

  if (QP != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_inv_mod(QP, Q, P), cleanup);
    }

cleanup:
  esp32c3_mpi_free(&K);

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32c3_rsa_import
 *
 * Description:
 *   Imports a set of core parameters into an RSA context.
 *
 * Input Parameters:
 *   ctx  - The initialized RSA context to store the parameters in
 *   N    - The RSA modulus
 *   P    - The first prime factor of \p N
 *   Q    - The second prime factor of \p N
 *   D    - The private exponent
 *   E    - The public exponent
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_import(struct esp32c3_rsa_context_s *ctx,
            const struct esp32c3_mpi_s *N,
            const struct esp32c3_mpi_s *P, const struct esp32c3_mpi_s *Q,
            const struct esp32c3_mpi_s *D, const struct esp32c3_mpi_s *E)
{
  int ret;
  DEBUGASSERT(ctx != NULL);

  if ((N != NULL && (ret = esp32c3_mpi_copy(&ctx->N, N)) != 0) ||
     (P != NULL && (ret = esp32c3_mpi_copy(&ctx->P, P)) != 0) ||
     (Q != NULL && (ret = esp32c3_mpi_copy(&ctx->Q, Q)) != 0) ||
     (D != NULL && (ret = esp32c3_mpi_copy(&ctx->D, D)) != 0) ||
     (E != NULL && (ret = esp32c3_mpi_copy(&ctx->E, E)) != 0))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
    }

  if (N != NULL)
    {
      ctx->len = esp32c3_mpi_size(&ctx->N);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_import_raw
 *
 * Description:
 *   Imports core RSA parameters into an RSA context.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to store the parameters in
 *   N        - The RSA modulus
 *   NL    - The Byte length of \p N
 *   P        - The first prime factor of \p N
 *   PL    - The Byte length of \p P
 *   Q        - The second prime factor of \p N
 *   QL    - The Byte length of \p Q
 *   D        - The private exponent
 *   DL    - The Byte length of \p D
 *   E        - The public exponent
 *   EL    - The Byte length of \p E
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_import_raw(struct esp32c3_rsa_context_s *ctx,
              unsigned char const *N, size_t NL,
              unsigned char const *P, size_t PL,
              unsigned char const *Q, size_t QL,
              unsigned char const *D, size_t DL,
              unsigned char const *E, size_t EL)
{
  int ret = 0;
  DEBUGASSERT(ctx != NULL);

  if (N != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&ctx->N, N, NL), cleanup);
      ctx->len = esp32c3_mpi_size(&ctx->N);
    }

  if (P != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&ctx->P, P, PL), cleanup);
    }

  if (Q != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&ctx->Q, Q, QL), cleanup);
    }

  if (D != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&ctx->D, D, DL), cleanup);
    }

  if (E != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&ctx->E, E, EL), cleanup);
    }

cleanup:
  if (ret != 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_complete
 *
 * Description:
 *   Completes an RSA context from a set of imported core parameters.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context holding imported parameters
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_complete(struct esp32c3_rsa_context_s *ctx)
{
  int ret = 0;
  int have_n;
  int have_p;
  int have_q;
  int have_d;
  int have_e;
#if !defined(ESP32C3_RSA_NO_CRT)
  int have_dp;
  int have_dq;
  int have_qp;
#endif
  int n_missing;
  int pq_missing;
  int d_missing;
  int is_pub;
  int is_priv;

  DEBUGASSERT(ctx != NULL);

  have_n = (esp32c3_mpi_cmp_int(&ctx->N, 0) != 0);
  have_p = (esp32c3_mpi_cmp_int(&ctx->P, 0) != 0);
  have_q = (esp32c3_mpi_cmp_int(&ctx->Q, 0) != 0);
  have_d = (esp32c3_mpi_cmp_int(&ctx->D, 0) != 0);
  have_e = (esp32c3_mpi_cmp_int(&ctx->E, 0) != 0);

#if !defined(ESP32C3_RSA_NO_CRT)
  have_dp = (esp32c3_mpi_cmp_int(&ctx->DP, 0) != 0);
  have_dq = (esp32c3_mpi_cmp_int(&ctx->DQ, 0) != 0);
  have_qp = (esp32c3_mpi_cmp_int(&ctx->QP, 0) != 0);
#endif

