apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
  /* Check whether provided parameters are enough */

  n_missing  =  have_p &&  have_q &&  have_d && have_e;
  pq_missing =  have_n && !have_p && !have_q &&  have_d && have_e;
  d_missing  =  have_p &&  have_q && !have_d && have_e;
  is_pub     =  have_n && !have_p && !have_q && !have_d && have_e;

  /* These three alternatives are mutually exclusive */

  is_priv = n_missing || pq_missing || d_missing;

  if (!is_priv && !is_pub)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  /* Step 1: Deduce N if P, Q are provided */

  if (!have_n && have_p && have_q)
    {
      if ((ret = esp32c3_mpi_mul_mpi(&ctx->N, &ctx->P,
                      &ctx->Q)) != 0)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
        }

      ctx->len = esp32c3_mpi_size(&ctx->N);
    }

  /* Step 2: Deduce and verify all remaining core parameters */

  if (pq_missing)
    {
      ret = esp32c3_rsa_deduce_primes(&ctx->N, &ctx->E, &ctx->D,
                                      &ctx->P, &ctx->Q);
      if (ret != 0)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
        }
    }
  else if (d_missing)
    {
      if ((ret = esp32c3_rsa_deduce_private_exponent(&ctx->P, &ctx->Q,
                                                     &ctx->E, &ctx->D)) != 0)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
        }
    }

  /* Step 3: Deduce all additional parameters to RSA implementation */

#if !defined(ESP32C3_RSA_NO_CRT)
  if (is_priv && ! (have_dp && have_dq && have_qp))
    {
      ret = esp32c3_rsa_deduce_crt(&ctx->P, &ctx->Q, &ctx->D,
                                   &ctx->DP, &ctx->DQ, &ctx->QP);
      if (ret != 0)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
        }
    }
#endif /* ESP32C3_RSA_NO_CRT */

  /* Step 3: Basic sanity checks */

  return (rsa_check_context(ctx, is_priv, 1));
}

/****************************************************************************
 * Name: esp32c3_rsa_export_raw
 *
 * Description:
 *   Eexports core parameters of an RSA key in raw big-endian binary format.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context
 *   N        - The Byte array to store the RSA modulus
 *   NL    - The size of the buffer for the modulus
 *   P        - The Byte array to hold the first prime factor of \p N
 *   PL    - The size of the buffer for the first prime factor
 *   Q        - The Byte array to hold the second prime factor of \p N
 *   QL    - The size of the buffer for the second prime factor
 *   D        - The Byte array to hold the private exponent
 *   DL    - The size of the buffer for the private exponent
 *   E        - The Byte array to hold the public exponent
 *   EL    - The size of the buffer for the public exponent
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_export_raw(const struct esp32c3_rsa_context_s *ctx,
              unsigned char *N, size_t NL,
              unsigned char *P, size_t PL,
              unsigned char *Q, size_t QL,
              unsigned char *D, size_t DL,
              unsigned char *E, size_t EL)
{
  int ret = 0;
  int is_priv;
  DEBUGASSERT(ctx != NULL);

  /* Check if key is private or public */

  is_priv = esp32c3_mpi_cmp_int(&ctx->N, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->P, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->Q, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->D, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->E, 0) != 0;

  if (!is_priv)
    {
      /* It can't try to export private parameters for a public key */

      if (P != NULL || Q != NULL || D != NULL)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
        }
    }

  if (N != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&ctx->N, N, NL), cleanup);
    }

  if (P != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&ctx->P, P, PL), cleanup);
    }

  if (Q != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&ctx->Q, Q, QL), cleanup);
    }

  if (D != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&ctx->D, D, DL), cleanup);
    }

  if (E != NULL)
    {
      ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&ctx->E, E, EL), cleanup);
    }

cleanup:
  return ret;
}

/****************************************************************************
 * Name: esp32c3_rsa_export
 *
 * Description:
 *   Exports the core parameters of an RSA key.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context
 *   N        - The MPI to hold the RSA modulus
 *   P        - The MPI to hold the first prime factor of \p N
 *   Q        - The MPI to hold the second prime factor of \p N
 *   D        - The MPI to hold the private exponent
 *   E        - The MPI to hold the public exponent
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_export(const struct esp32c3_rsa_context_s *ctx,
                       struct esp32c3_mpi_s *N,
                       struct esp32c3_mpi_s *P,
                       struct esp32c3_mpi_s *Q,
                       struct esp32c3_mpi_s *D,
                       struct esp32c3_mpi_s *E)
{
  int ret;
  int is_priv;
  DEBUGASSERT(ctx != NULL);

  /* Check if key is private or public */

  is_priv =
    esp32c3_mpi_cmp_int(&ctx->N, 0) != 0 &&
    esp32c3_mpi_cmp_int(&ctx->P, 0) != 0 &&
    esp32c3_mpi_cmp_int(&ctx->Q, 0) != 0 &&
    esp32c3_mpi_cmp_int(&ctx->D, 0) != 0 &&
    esp32c3_mpi_cmp_int(&ctx->E, 0) != 0;

  if (!is_priv)
    {
      /* It can't try to export private parameters for a public key */

      if (P != NULL || Q != NULL || D != NULL)
        {
          return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
        }
    }

  /* Export all requested core parameters. */

  if ((N != NULL && (ret = esp32c3_mpi_copy(N, &ctx->N)) != 0) ||
      (P != NULL && (ret = esp32c3_mpi_copy(P, &ctx->P)) != 0) ||
      (Q != NULL && (ret = esp32c3_mpi_copy(Q, &ctx->Q)) != 0) ||
      (D != NULL && (ret = esp32c3_mpi_copy(D, &ctx->D)) != 0) ||
      (E != NULL && (ret = esp32c3_mpi_copy(E, &ctx->E)) != 0))
    {
      return ret;
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_export_crt
 *
 * Description:
 *   Exports CRT parameters of a private RSA key.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context
 *   DP       - The MPI to hold \c D modulo `P-1`
 *   DQ       - The MPI to hold \c D modulo `Q-1`
 *   QP       - The MPI to hold modular inverse of \c Q modulo \c P
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_export_crt(const struct esp32c3_rsa_context_s *ctx,
                           struct esp32c3_mpi_s *DP,
                           struct esp32c3_mpi_s *DQ,
                           struct esp32c3_mpi_s *QP)
{
  int ret;
  int is_priv;
  DEBUGASSERT(ctx != NULL);

  /* Check if key is private or public */

