apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
  is_priv = esp32c3_mpi_cmp_int(&ctx->N, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->P, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->Q, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->D, 0) != 0 &&
            esp32c3_mpi_cmp_int(&ctx->E, 0) != 0;

  if (!is_priv)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

#if !defined(ESP32C3_RSA_NO_CRT)
  /* Export all requested blinding parameters. */

  if ((DP != NULL && (ret = esp32c3_mpi_copy(DP, &ctx->DP)) != 0) ||
      (DQ != NULL && (ret = esp32c3_mpi_copy(DQ, &ctx->DQ)) != 0) ||
      (QP != NULL && (ret = esp32c3_mpi_copy(QP, &ctx->QP)) != 0))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
    }
#else
  if ((ret = esp32c3_rsa_deduce_crt(&ctx->P, &ctx->Q, &ctx->D,
                                    DP, DQ, QP)) != 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA + ret);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_init
 *
 * Description:
 *   Initializes an RSA context
 *
 * Input Parameters:
 *   ctx      - The RSA context to initialize
 *   padding  - The padding mode to use
 *   hash_id  - The hash identifier of
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_rsa_init(struct esp32c3_rsa_context_s *ctx,
         int padding,
         int hash_id)
{
  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(padding == ESP32C3_RSA_PKCS_V15 ||
              padding == ESP32C3_RSA_PKCS_V21);

  memset(ctx, 0, sizeof(struct esp32c3_rsa_context_s));

  esp32c3_rsa_set_padding(ctx, padding, hash_id);
}

/****************************************************************************
 * Name: esp32c3_rsa_set_padding
 *
 * Description:
 *   Sets padding for an already initialized RSA context.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to be configured
 *   padding  - The padding mode to use
 *   hash_id  - The hash identifier
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_rsa_set_padding(struct esp32c3_rsa_context_s *ctx,
                             int padding, int hash_id)
{
  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(padding == ESP32C3_RSA_PKCS_V15 ||
              padding == ESP32C3_RSA_PKCS_V21);

  ctx->padding = padding;
  ctx->hash_id = hash_id;
}

/****************************************************************************
 * Name: esp32c3_rsa_get_len
 *
 * Description:
 *   Exports CRT parameters of a private RSA key.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context
 *
 * Returned Value:
 *   length of the RSA modulus in Bytes.
 *
 ****************************************************************************/

size_t esp32c3_rsa_get_len(const struct esp32c3_rsa_context_s *ctx)
{
  return (ctx->len);
}

/****************************************************************************
 * Name: esp32c3_rsa_check_pubkey
 *
 * Description:
 *   checks if a context contains at least an RSA public key..
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to check
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_check_pubkey(const struct esp32c3_rsa_context_s *ctx)
{
  DEBUGASSERT(ctx != NULL);

  if (rsa_check_context(ctx, 0 /* public */, 0 /* no blinding */) != 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

  if (esp32c3_mpi_bitlen(&ctx->N) < 128)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

  if (esp32c3_mpi_get_bit(&ctx->E, 0) == 0 ||
      esp32c3_mpi_bitlen(&ctx->E)   < 2  ||
      esp32c3_mpi_cmp_mpi(&ctx->E, &ctx->N) >= 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_check_privkey
 *
 * Description:
 *   Checks if a context contains at least an RSA private key
 *   and perform basic consistency checks.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to check
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_check_privkey(const struct esp32c3_rsa_context_s *ctx)
{
  DEBUGASSERT(ctx != NULL);

  if (esp32c3_rsa_check_pubkey(ctx) != 0 ||
      rsa_check_context(ctx, 1 /* private */, 1 /* blinding */) != 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

  if (esp32c3_rsa_validate_params(&ctx->N, &ctx->P, &ctx->Q,
                                  &ctx->D, &ctx->E, NULL, NULL) != 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

#if !defined(ESP32C3_RSA_NO_CRT)
  else if (esp32c3_rsa_validate_crt(&ctx->P, &ctx->Q, &ctx->D,
                                    &ctx->DP, &ctx->DQ, &ctx->QP) != 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }
#endif

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_check_pub_priv
 *
 * Description:
 *   Checks a public-private RSA key pair. It checks each of the contexts,
 *   and makes sure they match.
 *
 * Input Parameters:
 *   pub      - The initialized RSA context holding the public key
 *   prv      - The initialized RSA context holding the private key
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_check_pub_priv(const struct esp32c3_rsa_context_s *pub,
                const struct esp32c3_rsa_context_s *prv)
{
  DEBUGASSERT(pub != NULL);
  DEBUGASSERT(prv != NULL);

  if (esp32c3_rsa_check_pubkey(pub)  != 0 ||
      esp32c3_rsa_check_privkey(prv) != 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

  if (esp32c3_mpi_cmp_mpi(&pub->N, &prv->N) != 0 ||
      esp32c3_mpi_cmp_mpi(&pub->E, &prv->E) != 0)
    {
      return (ESP32C3_ERR_RSA_KEY_CHECK_FAILED);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_public
 *
 * Description:
 *   Performs an RSA public key operation.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to use
 *   input    - The input buffer
 *   output   - The output buffer
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

