apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
int esp32c3_rsa_public(struct esp32c3_rsa_context_s *ctx,
        const unsigned char *input,
        unsigned char *output)
{
  int ret;
  size_t olen;
  struct esp32c3_mpi_s T;
  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(input != NULL);
  DEBUGASSERT(output != NULL);

  if (rsa_check_context(ctx, 0 /* public */, 0 /* no blinding */))
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  esp32c3_mpi_init(&T);

  ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&T, input, ctx->len), cleanup);

  if (esp32c3_mpi_cmp_mpi(&T, &ctx->N) >= 0)
    {
      ret = ESP32C3_ERR_MPI_BAD_INPUT_DATA;
      goto cleanup;
    }

  olen = ctx->len;
  ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&T, &T, &ctx->E, &ctx->N, &ctx->RN),
                  cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&T, output, olen), cleanup);

cleanup:
  esp32c3_mpi_free(&T);

  if (ret != 0)
    {
      return (ESP32C3_ERR_RSA_PUBLIC_FAILED + ret);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_private
 *
 * Description:
 *   Performs an RSA private key operation.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to use
 *   f_rng    - The RNG function
 *   p_rng    - The RNG context to pass to \p f_rng
 *   input    - The input buffer
 *   output   - The output buffer
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_private(struct esp32c3_rsa_context_s *ctx,
         int (*f_rng)(void *, unsigned char *, size_t),
         void *p_rng,
         const unsigned char *input,
         unsigned char *output)
{
  int ret;
  size_t olen;

  /* Temporary holding the result */

  struct esp32c3_mpi_s T;

  /* Temporaries holding P-1, Q-1 and the exponent blinding factor */

  struct esp32c3_mpi_s P1, Q1, R;

#if !defined(ESP32C3_RSA_NO_CRT)
  /* Temporaries holding the results mod p resp. mod q. */

  struct esp32c3_mpi_s TP, TQ;

  /* Temporaries holding the blinded exponents */

  struct esp32c3_mpi_s dp_blind, dq_blind;

  /* Pointers to actual exponents to be used */

  struct esp32c3_mpi_s *DP = &ctx->DP;
  struct esp32c3_mpi_s *DQ = &ctx->DQ;
#else
  /* Temporary holding the blinded exponent */

  struct esp32c3_mpi_s d_blind;

  /* Pointer to actual exponent to be used */

  struct esp32c3_mpi_s *D = &ctx->D;
#endif /* ESP32C3_RSA_NO_CRT */

  /* Temporaries holding the initial input */

  struct esp32c3_mpi_s I, C;

  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(input  != NULL);
  DEBUGASSERT(output != NULL);

  if (rsa_check_context(ctx, 1, f_rng != NULL) != 0)
    {
      return (ESP32C3_ERR_RSA_BAD_INPUT_DATA);
    }

  /* MPI Initialization */

  esp32c3_mpi_init(&T);

  esp32c3_mpi_init(&P1);
  esp32c3_mpi_init(&Q1);
  esp32c3_mpi_init(&R);

  if (f_rng != NULL)
    {
#if defined(ESP32C3_RSA_NO_CRT)
      esp32c3_mpi_init(&d_blind);
#else
      esp32c3_mpi_init(&dp_blind);
      esp32c3_mpi_init(&dq_blind);
#endif
    }

#if !defined(ESP32C3_RSA_NO_CRT)
  esp32c3_mpi_init(&TP); esp32c3_mpi_init(&TQ);
#endif

  esp32c3_mpi_init(&I);
  esp32c3_mpi_init(&C);

  /* End of MPI initialization */

  ESP32C3_MPI_CHK(esp32c3_mpi_read_binary(&T, input, ctx->len), cleanup);
  if (esp32c3_mpi_cmp_mpi(&T, &ctx->N) >= 0)
    {
      ret = ESP32C3_ERR_MPI_BAD_INPUT_DATA;
      goto cleanup;
    }

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&I, &T), cleanup);

  if (f_rng != NULL)
    {
      /* Blinding T = T * VI mod N */

      ESP32C3_MPI_CHK(rsa_prepare_blinding(ctx, f_rng, p_rng), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&T, &T, &ctx->VI), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&T, &T, &ctx->N), cleanup);

      /* Exponent blinding */

      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&P1, &ctx->P, 1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_sub_int(&Q1, &ctx->Q, 1), cleanup);

#if defined(ESP32C3_RSA_NO_CRT)
      /* d_blind = (P - 1) * (Q - 1) * R + D */

      ESP32C3_MPI_CHK(esp32c3_mpi_fill_random(&R, RSA_EXPONENT_BLINDING,
                      f_rng, p_rng), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&d_blind, &P1, &Q1), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&d_blind, &d_blind, &R), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&d_blind, &d_blind, &ctx->D),
                      cleanup);

      D = &d_blind;
#else
      /* dp_blind = (P - 1) * R + DP */

      ESP32C3_MPI_CHK(esp32c3_mpi_fill_random(&R, RSA_EXPONENT_BLINDING,
                      f_rng, p_rng), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&dp_blind, &P1, &R), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&dp_blind, &dp_blind,
                      &ctx->DP), cleanup);

      DP = &dp_blind;

      /* dq_blind = (Q - 1) * R + DQ */

      ESP32C3_MPI_CHK(esp32c3_mpi_fill_random(&R, RSA_EXPONENT_BLINDING,
                      f_rng, p_rng), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&dq_blind, &Q1, &R), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&dq_blind, &dq_blind,
                      &ctx->DQ), cleanup);

      DQ = &dq_blind;
#endif /* ESP32C3_RSA_NO_CRT */
    }

#if defined(ESP32C3_RSA_NO_CRT)
  ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&T, &T, D, &ctx->N, &ctx->RN),
                  cleanup);
#else
  /* TP = input ^ dP mod P and TQ = input ^ dQ mod Q */

  ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&TP, &T, DP, &ctx->P, &ctx->RP),
                  cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&TQ, &T, DQ, &ctx->Q, &ctx->RQ),
                  cleanup);

  /* T = (TP - TQ) * (Q^-1 mod P) mod P */

  ESP32C3_MPI_CHK(esp32c3_mpi_sub_mpi(&T, &TP, &TQ), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&TP, &T, &ctx->QP), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&T, &TP, &ctx->P), cleanup);

  /* T = TQ + T * Q */

  ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&TP, &T, &ctx->Q), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_add_mpi(&T, &TQ, &TP), cleanup);
#endif /* ESP32C3_RSA_NO_CRT */

  if (f_rng != NULL)
    {
      /* Unblind T = T * VF mod N */

