apache/nuttx/arch/risc-v/src/esp32c3-legacy/esp32c3_rsa.c
      ESP32C3_MPI_CHK(esp32c3_mpi_mul_mpi(&T, &T, &ctx->VF), cleanup);
      ESP32C3_MPI_CHK(esp32c3_mpi_mod_mpi(&T, &T, &ctx->N), cleanup);
    }

  /* Verify the result to prevent glitching attacks. */

  ESP32C3_MPI_CHK(esp32c3_mpi_exp_mod(&C, &T, &ctx->E,
                  &ctx->N, &ctx->RN), cleanup);
  if (esp32c3_mpi_cmp_mpi(&C, &I) != 0)
    {
      ret = ESP32C3_ERR_RSA_VERIFY_FAILED;
      goto cleanup;
    }

  olen = ctx->len;
  ESP32C3_MPI_CHK(esp32c3_mpi_write_binary(&T, output, olen), cleanup);

cleanup:
  esp32c3_mpi_free(&P1);
  esp32c3_mpi_free(&Q1);
  esp32c3_mpi_free(&R);

  if (f_rng != NULL)
    {
#if defined(ESP32C3_RSA_NO_CRT)
      esp32c3_mpi_free(&d_blind);
#else
      esp32c3_mpi_free(&dp_blind);
      esp32c3_mpi_free(&dq_blind);
#endif
    }

  esp32c3_mpi_free(&T);

#if !defined(ESP32C3_RSA_NO_CRT)
  esp32c3_mpi_free(&TP); esp32c3_mpi_free(&TQ);
#endif

  esp32c3_mpi_free(&C);
  esp32c3_mpi_free(&I);

  if (ret != 0)
    {
      return (ESP32C3_ERR_RSA_PRIVATE_FAILED + ret);
    }

  return OK;
}

/****************************************************************************
 * Name: esp32c3_rsa_encrypt
 *
 * Description:
 *   Adds the message padding, then performs an RSA operation. It is the
 *   generic wrapper for performing a PKCS#1 encryption operation using the
 *   \p mode from the context.
 *
 * Input Parameters:
 *   ctx      - The initialized RSA context to use
 *   f_rng    - The RNG to use
 *   p_rng    - The RNG context to be passed to \p f_rng
 *   mode     - The mode of operation
 *   ilen     - The length of the plaintext in Bytes
 *   input    - The input data to encrypt
 *   output   - The output buffer
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_encrypt(struct esp32c3_rsa_context_s *ctx,
             int (*f_rng)(void *, unsigned char *, size_t),
             void *p_rng,
             int mode, size_t ilen,
             const unsigned char *input,
             unsigned char *output)
{
  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(mode == ESP32C3_RSA_PRIVATE ||
              mode == ESP32C3_RSA_PUBLIC);
  DEBUGASSERT(output != NULL);
  DEBUGASSERT(input != NULL);

  switch (ctx->padding)
    {
#if defined(ESP32C3_PKCS1_V15)
      case ESP32C3_RSA_PKCS_V15:
        return esp32c3_rsa_pkcs1_v15_encrypt(ctx, f_rng, p_rng, mode, ilen,
                                             input, output);
#endif
      default:
        return (ESP32C3_ERR_RSA_INVALID_PADDING);
    }
}

/****************************************************************************
 * Name: esp32c3_rsa_decrypt
 *
 * Description:
 *   Performs an RSA operation, then removes the message padding.
 *
 * Input Parameters:
 *   ctx            - The initialized RSA context to use
 *   f_rng          - The RNG function
 *   p_rng          - The RNG context to be passed to \p f_rng
 *   mode           - The mode of operation
 *   olen           - The point which to store the length of the plaintext
 *   input          - The ciphertext buffer
 *   output         - The buffer used to hold the plaintext
 *   output_max_len - The length in Bytes of the output buffer \p output
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_decrypt(struct esp32c3_rsa_context_s *ctx,
             int (*f_rng)(void *, unsigned char *, size_t),
             void *p_rng,
             int mode, size_t *olen,
             const unsigned char *input,
             unsigned char *output,
             size_t output_max_len)
{
  DEBUGASSERT(ctx != NULL);
  DEBUGASSERT(mode == ESP32C3_RSA_PRIVATE ||
              mode == ESP32C3_RSA_PUBLIC);
  DEBUGASSERT(output_max_len == 0 || output != NULL);
  DEBUGASSERT(input != NULL);
  DEBUGASSERT(olen != NULL);

  switch (ctx->padding)
    {
#if defined(ESP32C3_PKCS1_V15)
      case ESP32C3_RSA_PKCS_V15:
        return esp32c3_rsa_pkcs1_v15_decrypt(ctx, f_rng, p_rng, mode, olen,
                                             input, output, output_max_len);
#endif
      default:
        return (ESP32C3_ERR_RSA_INVALID_PADDING);
    }
}

/****************************************************************************
 * Name: esp32c3_rsa_copy
 *
 * Description:
 *   Copies the components of an RSA context.
 *
 * Input Parameters:
 *   dst      - The destination context
 *   src      - The source context
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 ****************************************************************************/

int esp32c3_rsa_copy(struct esp32c3_rsa_context_s *dst,
                     const struct esp32c3_rsa_context_s *src)
{
  int ret;
  DEBUGASSERT(dst != NULL);
  DEBUGASSERT(src != NULL);

  dst->ver = src->ver;
  dst->len = src->len;

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->N, &src->N), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->E, &src->E), cleanup);

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->D, &src->D), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->P, &src->P), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->Q, &src->Q), cleanup);

#if !defined(ESP32C3_RSA_NO_CRT)
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->DP, &src->DP), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->DQ, &src->DQ), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->QP, &src->QP), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->RP, &src->RP), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->RQ, &src->RQ), cleanup);
#endif

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->RN, &src->RN), cleanup);

  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->VI, &src->VI), cleanup);
  ESP32C3_MPI_CHK(esp32c3_mpi_copy(&dst->VF, &src->VF), cleanup);

  dst->padding = src->padding;
  dst->hash_id = src->hash_id;

cleanup:
  if (ret != 0)
    {
      esp32c3_rsa_free(dst);
    }

  return ret;
}

/****************************************************************************
 * Name: esp32c3_rsa_free
 *
 * Description:
 *   Frees the components of an RSA key.
 *
 * Input Parameters:
 *   ctx      - The RSA context to free
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

void esp32c3_rsa_free(struct esp32c3_rsa_context_s *ctx)
{
  if (ctx == NULL)
    {
      return;
    }

  esp32c3_mpi_free(&ctx->VI);
  esp32c3_mpi_free(&ctx->VF);
  esp32c3_mpi_free(&ctx->RN);
  esp32c3_mpi_free(&ctx->D);
  esp32c3_mpi_free(&ctx->Q);
  esp32c3_mpi_free(&ctx->P);
  esp32c3_mpi_free(&ctx->E);
  esp32c3_mpi_free(&ctx->N);

#if !defined(ESP32C3_RSA_NO_CRT)
  esp32c3_mpi_free(&ctx->RQ);
  esp32c3_mpi_free(&ctx->RP);
  esp32c3_mpi_free(&ctx->QP);
  esp32c3_mpi_free(&ctx->DQ);
  esp32c3_mpi_free(&ctx->DP);
#endif /* ESP32C3_RSA_NO_CRT */
}

#endif

